Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་སེམས་ཅན་སྡུག་བསྔལ་བ་དག་ལ་བུ་གཅིག་པ་བཞིན་དུ་དགོངས་པ་མཛད་དེ།
en: Śāradvatī­putra, a tathāgata, arhat, and fully awakened buddha also thinks of suffering sentient beings as his only son.

source: དེ་བཞིན་གཤེགས་པ་དག་ཉོན་མོངས་པ་རྣམས་དང་ལྷན་ཅིག་གནས་པ་ནི་མ་ཡིན་ནོ།
en: But the tathāgatas do not stay together with the emotional defilements.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་ཤི་བའི་རོ་དང་ལྷན་ཅིག་མི་གནས་སོ།
en: Śāradvatī­putra, just as, for example, the great ocean will not remain together with a corpse without casting it up on the shore,

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དག་ཀྱང་ཉོན་མོངས་པ་རྣམས་དང་ལྷན་ཅིག་མི་གནས་སོ།
en: the tathāgatas do not stay together with the emotional defilements.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པས་ལམ་པོ་ཆེའི་བཞི་མདོར་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་མངོན་པར་སྤྲུལ་ཏེ།
en: Or it is like, for example, a magician or one of his skilled apprentices who magically projects a great gathering of people at the junction of four roads.

source: བྱ་བ་དག་སྟོན་ཀྱང་བྱ་བ་དེ་དག་ནི་ཡུལ་ན་མི་གནས་ཕྱོགས་ན་མི་གནས་ཏེ།
en: Though the conjurer displays those people performing actions, in fact those activities do not reside either in that location or in that position.

source: མ་སྐྱེས་མ་འགགས་ཤིང་འགག་པར་མི་འགྱུར་རོ།
en: Being unborn, those actions are neither obstructed nor do they come to an end.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་ཅིང་འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཡང་སྟོན་ཏེ།
en: Śāradvatī­putra, just so, the tathāgatas bring sentient beings to maturity and demonstrate aspirational conduct,

source: མཛད་པ་སྟོན་ཀྱང་སྤྱོད་པ་དེ་དག་ནི་ཡོད་པ་མ་ཡིན་ནོ།
en: but though they reveal such conduct it does not exist.

source: །དཔེར་ན་ནམ་མཁའི་ཁམས་ནི་རྣམ་པར་རྟོག་པ་མེད་ཅིང་སྤྲོས་པ་མེད་པའོ།
en: For instance, the element of space is without conceptual thought and without elaborations.

source: །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཡང་རྣམ་པར་རྟོག་པ་མེད་ཅིང་སྤྲོས་པ་མེད་དོ། །འོན་ཀྱང་སེམས་ཅན་རྣམས་དང་འཐུན་པར་དེ་བཞིན་གཤེགས་པ་རྣམས་འཐུན་པར་མཛད་དེ།
en: Nevertheless, the tathāgatas act in conformity with sentient beings. Similarly, the body of a tathāgata is without conceptual thought and without elaborations.

source: སེམས་ཅན་རྣམས་ཇི་ལྟར་འདུལ་བར་འགྱུར་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་འཐུན་པར་འཇུག་གོ།
en: Nevertheless, the tathāgatas act in conformity with the way that is most conducive to the training of sentient beings.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པ་མི་མངའོ། །དེ་བཞིན་གཤེགས་པ་ལ་མི་མཁྱེན་པ་མི་མངའོ། །དེ་བཞིན་གཤེགས་པ་ལ་བསྙེལ་བ་མི་མངའོ།
en: “Śāradvatī­putra, the Tathāgata does not have delusion, nor does he harbor unknowing or forgetting.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ང་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཐུ་བོ་དང་། གཙོ་བོ་དང་། རབ་དང་། མཆོག་དང་། ཕུལ་དང་། བླ་མ་དང་། བླ་ན་མེད་པ་དང་། གོང་ན་མེད་པ་དང་། མི་མཉམ་པ་དང་མཉམ་པ་ཡིན་ཏེ།
en: Śāradvatī­putra, I am the elder brother of the world, and together with its gods I am the chief, the superior, the best, the preeminent, the revered, the unsurpassed, the one without a superior, and the one equal to the unequaled.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཚིག་སྨྲས་པ་འདི་ནི་བདེན་པའི་རྗེས་སུ་འཐུན་པའོ།
en: Śāradvatī­putra, this statement of mine corresponds to the truth.

source: །རབ་ཏུ་བྱུང་བའམ། ཁྱིམ་པ་ཡང་རུང་སྟེ།
en: Whether they are monks or laymen,

source: སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤོང་བ་དེ་དག་ཐམས་ཅད་ནི་སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་འདི་ལྟ་བུ་དག་རྙེད་པར་འགྱུར་རོ།
en: all those beings who reject this Dharma discourse will experience the sufferings of hell in this way.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་འདི་ཐོས་ནས་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Subhūti, after hearing what the Blessed One had taught, said,

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་དེ་དག་གིས་ནི་རྙེད་པ་ནོངས་པར་རྙེད་དོ།
en: “Blessed One, what those sentient beings gain, they gain as a crime.

source: །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤོང་བར་འགྱུར་བ་དེ་དག་ལྕེ་ཅི་འདྲ་བ་ཞིག་ཏུ་འགྱུར་བ་ལགས།
en: What will the tongues of those who abandon this Dharma discourse be like?”

source: རབ་འབྱོར་དེ་དག་གི་ལྕེ་ནི་དཔག་ཚད་འབུམ་པར་འགྱུར་ཏེ། དེ་ལ་ལྕགས་ཀྱི་ཐོང་གཤོལ་འབར་བ་རབ་ཏུ་འབར་བ་ཀུན་དུ་རབ་ཏུ་འབར། ཀུན་དུ་རབ་ཏུ་མཆེད་ཅིང་འབར་བ། མེ་ལྕེ་གཅིག་ཏུ་གྱུར་བ་བྱེ་བ་ཕྲག་ལྔ་བརྒྱས་རྨོ་བར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Subhūti, their tongues will grow a hundred thousand yojanas long, and they will be plowed by a flaming iron plow that burns hotter and hotter, flaming higher and higher and more and more intensely, bursting into five hundred million individual tongues of flame. Why so?

source: འདི་ལྟར་དེས་ངག་མ་བསྲུངས་པའི་ཕྱིར་ཏེ།
en: Because they did not guard their speech.

source: རབ་འབྱོར་མི་གཏི་མུག་པ་དེ་དག་གི་ལས་ཀྱི་སྒྲིབ་པ་ནི་དེ་ལྟ་བུར་འགྱུར་རོ།
en: Subhūti, those ignorant ones will be subject to karmic obscurations like that.”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་དེ་བཞིན་གཤེགས་པས་བསྟན་པ་ནི་རྨད་དུ་བྱུང་བ་ཆེན་པོ་ལགས་སོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ།
en: Then by the power of the Buddha, the entire assembly of disciples uttered the solemn utterance: “What the Tathāgata has taught is a great marvel!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then Indra, king of gods, said to the Blessed One,

source: །བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་སྨྲ་བའི་དགེ་སློང་དེ་དག་ཕྲག་པ་ལ་བཀུར་བར་བགྱིའོ།
en: “Blessed One, I will carry in homage on my shoulders those monks who teach this Dharma.

source: །མེ་ཏོག་དང་བདུག་པ་དང་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་རྣམས་ཀྱིས་མཆོད་པར་བགྱིའོ།
en: I will worship them with flowers, incense, fragrance, garlands, and unguent oils.

source: །གདུགས་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་ཕྱག་བགྱིའོ།
en: I will bow after offering parasols three times by day and three times by night.

source: །བསྙེན་བཀུར་བགྱིའོ། །བསྟི་སྟང་བགྱིའོ། །བླ་མར་བགྱིའོ། །རི་མོར་བགྱིའོ། །མཆོད་པར་བགྱིའོ། །རྗེད་པར་བགྱིའོ། །གསོལ་བར་བགྱིའོ། །
en: I will venerate, I will pay homage, I will adore as my guru, I will pay respect, I will worship, I will venerate, and I will honor them.

source: བསྟི་སྟང་བགྱི་བ་དང་། བླ་མར་བགྱི་བ་དང་། གུས་པས་བསྲུང་བར་བགྱིའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: I will pay them homage, honor them as guru, and respectfully protect them. Why so?

source: དེ་དག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྲས་ཏེ་ཆོས་ཀྱི་སྐུ་ལས་ངེས་པར་བྱུང་བའི་སླད་དུའོ།
en: Because they are the sons of the Blessed One and have left everything behind on the basis of the dharmakāya.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་བུར་གྱུར་པ། གཟུགས་བཟང་བ། མཛེས་པ།
en: Blessed One, it is like, for example, the son of a king of the royal lineage who has been anointed prince and successor, who has a fine body and who is good looking and handsome.

source: བལྟ་ན་སྡུག་པ་དེ་ནི་འོག་མ་ཐམས་ཅད་ཀྱི་མཆོད་པའི་འོས་དང་། ཕྱག་བགྱི་བའི་འོས་ལགས་སོ།
en: He is worthy of the respect of all his underlings and worthy of their honor.

source: །དེ་བཞིན་དུ་ཆོས་སྨྲ་བ་དེ་དག་ཀྱང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོད་པའི་འོས་དང་ཕྱག་བགྱི་བའི་འོས་ལགས་སོ།
en: Similarly, those teachers of this Dharma teaching are worthy of the respect and honor of the world, together with its gods.”

source: །རིགས་ཀྱི་བུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཆོས་སྨྲ་བའི་དགེ་སློང་དེ་དག་སྙིང་ལས་ཆུང་ངུར་བྱ་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཀུན་དུ་བསྲུང་བ་དང་། བསྐྱབ་པའི་ཕྱིར་ཚིག་འདི་ལེགས་པར་སྨྲས་སོ།
en: “Son of a good family, Indra spoke well when he said he would keep those monks safe from worries and protect and watch over them.”

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ཀུན་དུ་བསྲུང་བར་བགྱིའོ།
en: “Blessed One, I, too, will watch over those sons or daughters of good families.

source: ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ།
en: I will protect them, favor them, and make them attain peace and excellent happiness.

source: །དཔག་ཚད་བརྒྱ་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: Within an area a hundred yojanas in circumference, I will watch over them.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་ལ་རིགས་ཀྱི་བུ་ཚིག་འདི་ལེགས་པར་སྨྲས་པ་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: Then the Blessed One said to Samanta­bhadra, “Son of a good family, your well-spoken words are excellent, excellent!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པའི་དབྱངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་བཀའ་སྩལ་ཏོ།
en: Then the Blessed One spoke this verse with the beautiful voice of Brahmā:

source: །གཞན་ལ་ཕན་དང་བདེ་བ་བྱེད་པ་བསགས་པ་པོ།
en: “Accumulating benefits for others and causing them happiness,

source: །རྣམ་པ་སྣ་ཚོགས་རབ་མཛེས་མཆོག་རབ་ཚིག་ལྡན་པ།
en: Endowed with excellent supreme words that are utterly beautiful,

source: ཤིན་ཏུ་དྲི་མེད་བཞིན་ལྡན་ཁྱོད་ཀྱི་བསམ་པ་མཆོག །ཡོན་ཏན་རིན་ཆེན་མི་མཉམ་མཉམ་པའི་ཚིགས་ལེགས་སྨྲས།
en: You, with an immaculate face, expressed well Your highest thoughts—incomparable jewels of excellent qualities.”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཆོས་དུ་དང་ལྡན་ན་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འཐོབ་པར་འགྱུར།
en: “What are the qualities that those bodhisattva great beings must possess for them to obtain the dhāraṇī of the jewel torch?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཆོས་གཅིག་དང་ལྡན་ན་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འཐོབ་བོ།
en: “Son of a good family, those bodhisattva great beings will obtain the dhāraṇī of the jewel torch if they possess one quality.

source: །ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: What is it?

source: འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པའོ།
en: It is not having anger toward any sentient beings.

source: །ཀུན་དུ་བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གི་ཆོས་གཉིས་ཏེ།
en: Also, Samanta­bhadra, those bodhisattva great beings should have two more qualities.

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are they?

source: ཕྲག་དོག་མེད་པ་དང་། རློམ་སེམས་མེད་པ་སྟེ།
en: They are to have neither jealousy nor pride.

source: ཀུན་དུ་བཟང་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གི་ཆོས་གཉིས་སོ།
en: Those are the qualities of the bodhisattva great beings.

source: །ཀུན་དུ་བཟང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་དབང་པོ་གནོད་པར་མི་འགྱུར་རོ།
en: Moreover, Samanta­bhadra, those bodhisattva great beings should not harm the faculties of any sentient beings.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྣམ་པར་འཚེ་བ་བསྐྱེད་པར་མི་བྱའོ།
en: Samanta­bhadra, furthermore, in all ways and in all respects, a bodhisattva should not cause harm to any sentient beings.”

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བརྗོད་པ་འདི་བཤད་པ་དང་། དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཀྱི་ཁྱད་པར་གྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་བཤད་པ་ན་ལྷ་དང་། མིའི་སྐྱེ་དགུ་ལས་སེམས་ཅན་དཔག་ཏུ་མེད་པས་གཟུངས་ཐོབ་པར་གྱུར་ཏོ།
en: When the qualities of bodhisattvas were explained and the special virtues of the dhāraṇī of the jewel torch were taught in detail, infinite numbers of human beings attained the non-forgetting retention of the dhāraṇī.

source: །དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་ཀྱི་ཁྱད་པར་གྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པའི་ལེའུའོ།། །།
en: Here ends the chapter in which the special virtues of the dhāraṇī of the jewel torch were taught in detail.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then the venerable Ānanda arose from his seat and, covering one shoulder with his robe, knelt on one knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Bowing with folded hands toward the seat of the Blessed One, he said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཟབ་ལགས་སོ།
en: “Blessed One, this Dharma discourse is profound.”

source: ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ཏེ།
en: “Ānanda, so it is.

source: གཟུགས་ཟབ་པའི་ཕྱིར་ཟབ་བོ།
en: Because the aggregate of form is profound, it is profound.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཟབ་པའི་ཕྱིར་ཟབ་བོ།
en: Because the aggregates of feeling, perception, mental forces, and cognition are profound, it is profound.

source: །སྟོང་པ་ཉིད་ཟབ་པའི་ཕྱིར་ཟབ་བོ།
en: Because emptiness is profound, it is profound.

source: །ནམ་མཁའ་ཟབ་པའི་ཕྱིར་ཟབ་བོ།
en: Because the element of space is profound, it is profound.”

source: །ཀུན་དགའ་བོས་གསོལ་པ།
en: Ānanda said,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་བཞིན་གཤེགས་པ་ལས་མངོན་དུ་ཐོས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་ནི་ནམ་ཡང་མ་ཐོས་སོ།
en: “Though I have heard eighty-four thousand articles of Dharma from the Tathāgata, I never heard one like the present Dharma discourse.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཤིན་ཏུ་ཐོས་པར་བྱ་དཀའ་བ་ཡིན་ནོ།
en: “This Dharma discourse is extremely difficult to receive.”

source: སླད་མའི་ཚེ་སླད་མའི་དུས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་པའི་དུས་ཀྱི་ཚེ་སེམས་ཅན་མང་པོ་དག་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བགྱིད་པར་འགྱུར་བར་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: “Blessed One, I beg you to magically bless this Dharma discourse so that in a later time and later period, during the last five hundred years when the noble Dharma is coming to an end, it will perform Buddha activities for many sentient beings.”

source: ཀུན་དགའ་བོ་ངས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབས་ཟིན་ཏེ།
en: “Ānanda, I have already blessed this Dharma discourse.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ངས་ཆོས་སྨྲ་བ་དེ་དག་ཀྱང་བྱིན་གྱིས་བརླབས་སོ།
en: I, the Tathāgata Śākyamuni, have also blessed those Dharma teachers who will teach it.

source: །ཀུན་དགའ་བོ་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་དེ་ནི་མིག་ན་བར་མི་འགྱུར།
en: Ānanda, those who write this Dharma discourse will not suffer eye disease.

source: ལྕེ་ན་བར་མི་འགྱུར། སྣ་ན་བར་མི་འགྱུར། སོ་ན་བར་མི་འགྱུར། ལག་པ་དང་རྐང་པ་ན་བར་མི་འགྱུར།
en: Their tongues, noses, teeth, hands, and feet will not become diseased.

source: ཀླད་པ་ན་བར་མི་འགྱུར། རྣ་བ་ན་བར་མི་འགྱུར།
en: Their brains will not be diseased, nor will their ears.

source: ལུས་དམན་པར་མི་འགྱུར། ལུས་དྲི་མི་ཞིམ་པར་མི་འགྱུར།
en: Their bodies will not deteriorate, nor will they smell bad.

source: ཕ་རོལ་གྱི་གནོད་པས་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: They will not be killed by harmful enemies.

source: །དེ་ལ་མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་སྲུང་བར་འགྱུར་རོ། །འདི་ནས་ཤི་འཕོས་ནས་ཀྱང་དེ་སྤྲོས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: They will be protected by all humans and non-human deities, and when they do die they will, avoiding other entanglements, be born in the happy realms among the gods.”

source: བཅོམ་ལྡན་འདས་ཆོས་འདི་བཤད་པའི་ཚེ་བདུད་བར་ཆད་མི་བགྱིད་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: “Blessed One, why did Māra not cause obstacles when you explained this Dharma? Owing to what conditions did that not occur?”

source: ཀུན་དགའ་བོ་བདུད་ཐམས་ཅད་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བར་ཆད་བྱེད་མི་ནུས་ཏེ།
en: “Ānanda, all māras were unable to create an obstacle to this Dharma discourse.

source: ཀུན་དགའ་བོ་གང་གི་ཚེ་བདུད་སྡིག་ཅན་འདི་སྙམ་དུ་བདག་དཀོན་མཆོག་ཏ་ལ་ལའི་གཟུངས་འཆད་པ་ལ་བར་ཆད་བྱེད་དུ་འགྲོའོ་སྙམ་པའི་སེམས་བསྐྱེད་པ་དེའི་ཚེ། བདུད་སྡིག་ཅན་གྱི་རང་གི་ཁྱིམ་ཀུན་དུ་འབར་བ་མཐོང་སྟེ།
en: Ānanda, when Māra the evil one conceived the intention to obstruct the teaching of the dhāraṇī of the jewel torch, he saw his own home burning in flames;

source: ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་ལྟར་ཟབ་བོ།
en: Ānanda, this Dharma discourse is so profound.

source: །ཀུན་དགའ་བོ་ས་ཕྱོགས་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པའི་ས་ཕྱོགས་དེ་མཆོད་རྟེན་དུ་འགྱུར། ཕྱག་བྱ་བའི་འོས་སུ་ཡང་འགྱུར་རོ།
en: Ānanda, any place where this Dharma discourse has been practiced becomes a holy stūpa shrine worthy of respect.”

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ས་ཕྱོགས་གང་ན་བཞུགས་པའི་ས་ཕྱོགས་དེ་ཉིད་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་གནས་པར་གྱུར་ལ།
en: “If in that very place where the Tathāgata dwells this Dharma discourse also exists,

source: བདག་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བའི་སླད་དུ་མཆིས་ཤིང་། མཆིས་ནས་ཀྱང་སྔར་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་བགྱིས་ནས་སླད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཕྱག་བགྱིས་ན་ནོངས་པ་ཅི་མཆིས།
en: how great would my error be if I went to see the Tathāgata and, after going there, I first bowed to that Tathāgata and later to this Dharma discourse?”

source: ཀུན་དགའ་བོ་གང་གི་ཚེ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་བཀོལ་ཏེ། ང་ལ་ཕྱག་འཚལ་བ་དེའི་ཚེ་ཁྱོད་ཉེས་པ་དང་བཅས་པར་འགྱུར་རོ།
en: “Ānanda, if you set this Dharma discourse to one side and bowed to me, that would be a fault.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་ང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཐུ་བོ་དང་། གཙོ་བོ་དང་། མཆོག་དང་། དམ་པ་ཡིན་མོད་ཀྱི།
en: Ānanda, moreover, though I am the elder brother of the world with its gods, the chief, the best, and the superior,

source: ཀུན་དགའ་བོ་ངས་སྔར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཕྱིས་བྱང་ཆུབ་མངོན་བར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Ānanda, I attained the perfect awakening of buddhahood after I heard this Dharma discourse.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་གང་ལས་ཏིང་ངེ་འཛིན་རིན་པོ་ཆེ་དཀོན་མཆོག་ཏ་ལ་ལ་བསྟན་པ་འདི་གསན་པ་དེ་བཞིན་གཤེགས་པའི་གོང་ན་སུ་མཆིས།
en: “Blessed One, from which tathāgata did you hear the teaching of the precious absorption of the dhāraṇī of the jewel torch? Who was higher than the Tathāgata?”

source: ཀུན་དགའ་བོ་མིའི་འཇིག་རྟེན་དང་ལྷའི་འཇིག་རྟེན་དང་དྲི་ཟའི་འཇིག་རྟེན་ན་ངའི་གོང་ན་སུ་ཡང་མེད་དེ།
en: “Ānanda, no one is higher than me in the worlds of men, gods, and gandharvas.

source: འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ངས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཐོགས་པ་མེད་པ་བརྩེགས་པའི་སྙིང་པོ་འོད་ཟེར་བཟང་པོ་བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་ཟེར་དུ་མའི་ལྟེ་བ་རྒྱས་པ་ལས་མངོན་དུ་ཐོས་ཏེ་
en: Yet when I was practicing the conduct of a bodhisattva, I learned from the blessed one, the tathāgata Layered Essence of Endless Gnosis, out of a vast matrix of many light rays radiating from wonderful inconceivable lights.

source: ཀུན་དགའ་བོ་བྱ་དཀའ་བ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་མྱོང་ནས་ངས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ཏེ།
en: Ānanda, after experiencing thousands and millions of ascetic hardships, I heard this Dharma discourse.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེས་ང་ལུང་བསྟན་ཏོ།
en: At that time, that tathāgata made a prophecy about me.

source: །ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་སྔར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཕྱག་གྱིས་ལ་ཕྱིས་ང་ལ་ཕྱག་འཚོལ་ཅིག
en: Therefore, Ānanda, first bow to this Dharma discourse and later pay homage to me.”

source: །དེ་ནས་བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Indra, Brahmā, and the guardian deities of the world then spoke unanimously:

source: །ཨ་ལ་ལ་ཆོས།
en: “How wonderful is the Dharma!

source: ཨ་ལ་ལ་ཆོས།
en: How wonderful is the Dharma!

source: ཆོས་རྣམས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་ཨ་ལ་ལའོ།
en: How wonderful are the magical powers of the Dharma teachings!

source: །སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཐོས་པ་དེ་དག་ཀྱང་ཕྱག་བྱ་བའི་འོས་ཡིན་ན།
en: If sentient beings who so much as hear the name of this Dharma discourse should be honored,

source: གང་དག་འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: it goes without saying that those who memorize, read, study, and teach it in detail to others should be honored all the more.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ཞེས་བརྗོད་པར་བྱའོ།
en: They should be called tathāgatas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་ལ་ཀྱེ་གྲོགས་པོ་དག་ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་པར་སྨྲས་པ་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: The Blessed One replied to Indra, Brahmā, and the guardian deities of the world, “Friends, your words are well spoken. Excellent, excellent!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་ནས་ལྗགས་ཀྱི་དབང་པོ་ཕྱུང་སྟེ།
en: The Blessed One now used the miraculous faculty of his tongue and,

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྗགས་ཀྱི་དབང་པོས་སྣང་བར་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: making his voice heard throughout the realm of the whole billionfold world system, said to the bodhisattva Samanta­bhadra,

source: །སེམས་ཅན་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མི་ཐོས་པ་དེ་དག་ནི་ཇི་ལྟར་མི་དམུས་ལོང་གིས་ཉི་མའི་སྣང་བ་མི་མཐོང་བ་དང་། ཇི་ལྟར་ཚོང་བ་ཐབས་མི་ཤེས་པ་དང་། ཇི་ལྟར་མི་དབུལ་པོ་གཞན་གྱི་ངོར་ལྟ་བ་དང་འདྲ་སྟེ།
en: “Those sentient beings who do not listen to this Dharma discourse are like blind people who do not see the light of the sun, like people who do not know how a transaction is made, and like poor people who look to others for support.

source: དེ་དག་གི་དོན་དུ་ངས་དཔེ་འདི་བྱས་ན་ཅི་ནས་སེམས་ཅན་རྣམས་ཆོས་རིན་པོ་ཆེའི་ཕུང་པོ་འདི་འདྲ་བ་ལས་རིང་དུ་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ཆེད་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ང་ཁྱོད་ལ་གསོལ་བ་འདེབས་ན་རིགས་ཀྱི་བུ་ཁྱོད་སྤྲོའམ།
en: In order to ensure that sentient beings do not become far removed from such a mass of precious teachings in the way I have illustrated with these similes, would it please you, son of a good family, if I were to make a request of you for the sake of this Dharma discourse and for the benefit of sentient beings?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then the bodhisattva Samanta­bhadra rose from his seat and covered one shoulder with his robe.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ངུ་ཞིང་
en: Bowing with folded hands toward the Blessed One, he wept.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་རང་གི་ཆོས་ཀྱི་སྟན་ལས་ལངས་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: As soon as the bodhisattva Samanta­bhadra rose from his Dharma mat, the entire billionfold world system shook in six ways,

source: རབ་ཏུ་གཡོས། ཀུན་དུ་རབ་ཏུ་གཡོས་སོ།
en: it shook strongly and shook violently;

source: །འགུལ། རབ་ཏུ་འགུལ། ཀུན་དུ་རབ་ཏུ་འགུལ་ཏོ།
en: it quaked, quaked strongly, and quaked violently;

source: །ལྡེག །རབ་ཏུ་ལྡེག །ཀུན་དུ་རབ་ཏུ་ལྡེག་གོ།
en: it trembled, trembled strongly, and trembled violently;

source: །འུར་འུར། རབ་ཏུ་འུར་འུར། ཀུན་དུ་རབ་ཏུ་འུར་འུར་རོ།
en: it was disturbed, strongly disturbed, and violently disturbed;

source: །ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་དུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ།
en: it shuddered, shuddered strongly, and shuddered violently;

source: །འཁྲུགས། རབ་ཏུ་འཁྲུགས། ཀུན་དུ་རབ་ཏུ་འཁྲུགས་སོ།
en: and it was agitated, strongly agitated, and violently agitated.

source: །འཇིག་རྟེན་དུ་སྣང་བ་ཆེན་པོ་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: And in the world a great light shone.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་སོར་མོ་བཅུ་ཐལ་མོ་སྦྱར་ཏེ་ངུ་ཞིང་
en: Then the bodhisattva Samanta­bhadra pressed the fingers of his hands together in homage and wept.

source: །བཅོམ་ལྡན་འདས་བདག་སྤྲོ་ལགས་སོ།
en: “Blessed One, I would be delighted.

source: །བདེ་བར་གཤེགས་པ་བདག་སྤྲོ་ལགས་སོ།
en: Sugata, I would be delighted.

source: །བཅོམ་ལྡན་འདས་ཁྱོད་ནི་ཐམས་ཅད་མཁྱེན་པ།
en: Blessed One, you are all-knowing,

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བཞེད་པ།
en: you intend the benefit of all sentient beings,

source: ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་བ་ལགས་ཀྱི་སྟེང་དུ་བདག་ནི་དེ་བཞིན་གཤེགས་པ་ལས་སྐྱེས་པ་ལགས་ན།
en: and you are endowed with great compassion. Yet on top of that, as I am born from the Tathāgata,

source: ཅིའི་སླད་དུ་དེ་བཞིན་གཤེགས་པའི་བཀའ་ལྟར་མི་བགྱིད།
en: why would I not act in accord with the Tathāgata’s word?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་བཀའ་ནི་བདུད་རྩིའི་བཀའ་ལགས་ན།
en: If the word of the Blessed One, the Tathāgata, is a word of ambrosia,

source: བདག་དེ་བཞིན་གཤེགས་པའི་བཀའ་དང་འགལ་བར་བགྱིད་པའི་མཐུ་བདག་ལ་ག་ལ་མཆིས།
en: how could I be capable of acting in contradiction to the Tathāgata’s word?

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་བྱས་པ་གཟོ་བར་བགྱི་བ་ལགས་ཀྱི། བྱས་པ་མི་གཟོ་བར་བགྱི་བ་མ་ལགས་སོ།
en: Blessed One, I will keep what you say in mind, I will not fail to keep it in mind.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ཀྱེ་རྒྱལ་བའི་སྲས་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One said to the bodhisattva Samanta­bhadra, “O son of the victors, excellent, excellent!

source: །ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྲས་ཀྱི་ཐུ་བོ་དང་། གཙོ་བོ་དང་མཆོག་དང་དམ་པ་དང་ཕུལ་ཡིན་ཏེ།
en: You are the elder son of the tathāgatas; the chief, the best, the superior, and the preeminent one.
